# USE
## Задание 16 — Вычисление рекуррентных выражений
Примерное время выполнения задания — *5 минут (по спецификатору)*
<br><br>
### 1. Задание из открытого банка ФИПИ (№*7C0639*)
*«Задания из открытого банка халява»* — прим. ред. <br>
> Алгоритм вычисления значения функции F(n), где n –
> целое неотрицательное число, задан следующими соотношениями:
> 
> F(n) = 0 при n ≤ 1;  
> F(n) = (n + 1) / 2 + F(n − 1), если n > 1 и при этом n нечётно;  
> F(n) = 2 × F(n − 1) + 1, если n > 1 и при этом n чётно.  
> 
> Чему равно значение функции **F(33)**?
> 
> Примечание. При вычислении значения F(n) используется операция целочисленного деления.
<br>

```python
def f(n):
    if n <= 1:
        return 0
    elif n % 2:
        return (n + 1) // 2 + f(n - 1)
    else:
        return 2 * f(n - 1) + 1

# Комментриев не будет, слишком легко 
print(f(33))
```

**Ответ: 262124** 
